app/views/students/index.html.erb

<h1>index page here!</h1>
<%Student.all.each do |st| %>
---
SELECT "students".* FROM "students"